app/controllers/movies_controller.rb

  def sort
#   col_header = nil
    logger.debug("enter sort - sort_saved session")
    logger.debug(self.sort_saved.inspect)
    if params[:col]
       col_header = params[:col].to_s
    else
      col_header = sort_saved
    end
    self.sort_saved = col_header
    logger.debug("after - sort_saved session")
    logger.debug(self.sort_saved.inspect)
    if col_header
      col = col_header.gsub("_header", '')
      @col = col
    end
    logger.debug("col.inspect")
    logger.debug(col.inspect)
    logger.debug("@col.inspect")
    logger.debug(@col.inspect)
    logger.debug(self.ratings_param_saved)
#    self.ratings_param_saved = params[:ratings] if params[:ratings]
#    @movies = Movie.find(:all, :order => col)
    if self.selected_movie_ratings
      @movies = Movie.where(:rating => @selected_ratings)
      if col
        @movies = @movies.order(col)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('co', 'comm', 'coolle', '', 'uf8') AND "movies"."order" = 'release_date'